import Link from "next/link";
import Footer from "../components/Footer";

export default function FAQPage() {
  return (
    <div className="simple-page">

      <div className="simple-header">
        <Link href="/" className="back-button">
          ← بازگشت
        </Link>
      </div>

      <div className="box simple-content">
        <h1>سوالات رایج</h1>

        <h3>نت رادار چه چیزی را اندازه‌گیری می‌کند؟</h3>
        <p>
          این سرویس دسترسی به برخی سرویس‌های اینترنتی را از طریق ... و همچنین سرعت دسترسی به سرویس مورد نظر بررسی می‌کند و نتیجه را
          در قالب وضعیت اتصال نمایش می‌دهد.
        </p>

        <h3>آیا نتایج همیشه دقیق هستند؟</h3>
        <p>
          نتایج بر اساس تست‌های خودکار هستند و ممکن است در برخی شرایط با تجربه
          واقعی کاربران تفاوت داشته باشند. ذکر این نکته حائز اهمیت است که ممکن است در دیتاسنترهای مورد استفاده ما 
          سرویسی برقرار باشد، اما برای یک کاربر دسترسی به آن سرویس برقرار نباشد و بالعکس. سرورهای مورد استفاده نت رادار در داخل ایران قرار دارند.
        </p>

        <h3>چرا بعضی سرویس‌ها ناپایدار نشان داده می‌شوند؟</h3>
        <p>
          ناپایداری معمولاً زمانی ثبت می‌شود که در بازه زمانی مشخص بخشی از تست‌ها
          با شکست مواجه شوند.
        </p>

      </div>

      <Footer />
    </div>
  );
}
